{
  "backend/main.mo": "Main Motoko actor for the AI Job Portal backend, defining types and CRUD operations for user profiles, job listings, applications, and interviews, with role-based access control, user approval, file storage, and Stripe integration mixins.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (Home page improvements, Admin Panel system reports, and dark mode coverage) to their relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose or stub status of every component, page, and hook in the Job Portal frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the light and dark color themes used throughout the app.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a root div and loads the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all page routes, renders the shared navigation/footer/chatbot layout, and shows a role-selection modal for newly authenticated users.",
  "frontend/src/components/AIRecommendations.tsx": "Component that fetches AI-generated job recommendations filtered by user skills and a selected category, then renders scored job cards with a match badge.",
  "frontend/src/components/CareerChatbot.tsx": "A floating chatbot UI component that provides career guidance by matching user input against a knowledge base and displaying bot/user messages in a chat panel with suggested questions.",
  "frontend/src/components/EarningsSummary.tsx": "A stub component kept to prevent import errors; it renders nothing as the EarningsSummary type no longer exists in the backend.",
  "frontend/src/components/EmployerAnalytics.tsx": "Displays per-job application statistics (total, shortlisted, hired, rejected) for an employer using bar charts powered by Recharts, fetching application data via a custom query hook.",
  "frontend/src/components/FarmingChatbot.tsx": "A floating FAQ-based chatbot for farming advice that matches user messages against a keyword-driven knowledge base covering topics like soil, irrigation, pests, and crop seasons.",
  "frontend/src/components/InterviewScheduler.tsx": "A form component that allows employers to schedule interviews by selecting a job, entering an applicant's Principal ID, date, time, and notes, and displays previously scheduled interviews.",
  "frontend/src/components/JobApplicationCard.tsx": "Renders a card showing a job application's title, employer, applied date, and status badge, with a button to download a PDF summary of the application.",
  "frontend/src/components/JobApplicationModal.tsx": "A dialog modal that shows job details and lets an authenticated user submit a job application, displaying a success state after submission.",
  "frontend/src/components/JobBrowser.tsx": "Renders a searchable, filterable job listing browser with search, location, and job type filters, fetching active jobs via a query hook and displaying them as JobCard components.",
  "frontend/src/components/JobCard.tsx": "Displays a single job listing card with title, location, salary, deadline, skills, and action buttons for viewing details, saving, or applying to a job.",
  "frontend/src/components/JobPostForm.tsx": "Form component for creating or editing a job listing, supporting fields for title, description, location, salary, job type, and required skills, with create/update mutation support.",
  "frontend/src/components/JobSeekerProfileForm.tsx": "Form for job seekers to edit their profile including name, preferred location, skills, education, and experience, persisting extended data to localStorage and saving core profile via a mutation.",
  "frontend/src/components/LanguageToggle.tsx": "A small button component that toggles the application language between English and Tamil using the useLanguage hook.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing loading state during authentication and clearing the query cache on logout.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, nav links, theme/language toggles, and an authenticated user dropdown menu with dashboard routing based on user role.",
  "frontend/src/components/ProductCard.tsx": "Stub component that renders nothing, kept to prevent import errors after the Product type was removed from the backend.",
  "frontend/src/components/ProductForm.tsx": "Stub component that renders nothing, kept to prevent import errors after the Product type was removed from the backend.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to home and users with incorrect roles to an access-denied page, showing a skeleton loader while auth state initializes.",
  "frontend/src/components/ResumeScoreDisplay.tsx": "Displays a resume score (out of 100) calculated from skills, education, experience, and resume file upload, with a progress bar and per-factor breakdown.",
  "frontend/src/components/ReviewForm.tsx": "Stub component that renders nothing; kept to prevent import errors after the review/useAddReview backend functionality was removed.",
  "frontend/src/components/RoleSelectionModal.tsx": "Modal dialog that prompts new users to enter their name and select a role (job seeker, employer, or admin), then saves the profile via useSaveCallerUserProfile.",
  "frontend/src/components/SalaryPredictionCard.tsx": "Displays an AI-predicted salary range for a given job category and years of experience, fetched via usePredictSalary.",
  "frontend/src/components/StripeConfigurationPanel.tsx": "Stub component that renders nothing; kept to prevent import errors after Stripe hooks were removed.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that toggles between light and dark themes using the useTheme hook, showing a Sun or Moon icon accordingly.",
  "frontend/src/components/WishlistManager.tsx": "Renders a grid of saved job listings using JobCard components, or an empty state if no jobs are saved.",
  "frontend/src/data/chatbotKnowledgeBase.ts": "Defines a FAQ knowledge base with keyword-matched entries covering resume writing, interview prep, career planning, skill development, and job search strategies for use by a chatbot.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useCart.ts": "Stub hook returning empty cart state and no-op functions; kept to prevent import errors after cart functionality was removed for the Job Portal.",
  "frontend/src/hooks/useGenerateApplicationPDF.ts": "Provides a generatePDF function that builds and opens an HTML-based printable application summary document with applicant details, job info, status, and skills.",
  "frontend/src/hooks/useGenerateInvoicePDF.ts": "Stub hook returning a no-op generateInvoicePDF function; kept to prevent import errors after invoice PDF functionality was removed.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useLanguage.ts": "Implements a shared language state hook supporting English and Tamil, with localStorage persistence and a translation lookup function.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor calls including user profiles, job listings, applications, and interviews with cache invalidation on mutations.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and applies the theme class to the document root.",
  "frontend/src/i18n/translations.ts": "Contains English and Tamil translation strings for all UI labels and messages used throughout the application.",
  "frontend/src/index.css": "Defines global CSS custom properties for light/dark themes using OKLCH colors, Tailwind base styles, and application-specific utility classes like status badge styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "Renders the About page with a hero image, mission statement, and step-by-step guides for job seekers and employers using i18n translations.",
  "frontend/src/pages/AccessDenied.tsx": "Displays an access denied page with a shield icon and navigation buttons that redirect users to the home page or their role-appropriate dashboard.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel with tabs for managing user approvals, job listings, and system analytics; supports approving/rejecting users and removing jobs.",
  "frontend/src/pages/CartCheckout.tsx": "Stub page that immediately redirects to the home route, replacing a removed cart/checkout feature.",
  "frontend/src/pages/CustomerDashboard.tsx": "Stub page that immediately redirects to the home route, replacing a removed customer dashboard feature.",
  "frontend/src/pages/EmployerDashboard.tsx": "Protected employer dashboard with tabs for managing job postings, viewing applicants, scheduling interviews, and analytics; includes an approval request banner.",
  "frontend/src/pages/FarmerDashboard.tsx": "Stub page that immediately redirects to the home route, replacing a removed farmer dashboard feature.",
  "frontend/src/pages/Home.tsx": "Landing page displaying a hero section, job category grid, and platform stats with navigation to job listings and role-based registration.",
  "frontend/src/pages/JobDetails.tsx": "Displays full details for a single job listing including skills, deadline, and salary prediction, with options to apply or save the job.",
  "frontend/src/pages/JobListings.tsx": "Browsable job listings page with search, location, job type, and salary filters, plus inline apply and save functionality.",
  "frontend/src/pages/JobSeekerDashboard.tsx": "Job seeker dashboard page with tabs for profile, job browsing, applications, wishlist, and AI recommendations. Wraps content in a ProtectedRoute requiring the 'job_seeker' role and manages saved jobs and seeker profile via localStorage.",
  "frontend/src/pages/PaymentFailure.tsx": "Simple payment failure page displaying an error card with a red XCircle icon and a button to navigate back to the home page.",
  "frontend/src/pages/PaymentSuccess.tsx": "Simple payment success page displaying a confirmation card with a green CheckCircle icon and buttons to navigate to the seeker dashboard or home page.",
  "frontend/src/pages/ProductListing.tsx": "Stub page that immediately redirects to '/jobs' since the product listing concept has been replaced by the job portal.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with helpers for persisting values in sessionStorage and cleaning sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palettes (portal, teal, amber), typography (Inter/DM Sans), border radii, box shadows, and keyframe animations for the job portal UI.",
  "project_state.json": "Project state metadata file describing the full-stack AI-based job portal architecture, existing implemented features, known issues, and versioning information."
}